## 값 기준 정렬 (sort_values)

In [31]:
import pandas as pd
import numpy as np

na = np.nan
data = [[-3,'A',17],
        [na,'D',31],
        [ 7,'D',-8],
        [15,'Z', 3],
        [ 0, na,-7]]
col = ['col1','col2','col3']
row = ['row1','row2','row3','row4','row5']
df = pd.DataFrame(data = data, index = row, columns= col)
print(df)

      col1 col2  col3
row1  -3.0    A    17
row2   NaN    D    31
row3   7.0    D    -8
row4  15.0    Z     3
row5   0.0  NaN    -7

In [32]:
df.sort_values(by='col1')

      col1 col2  col3
row1  -3.0    A    17
row5   0.0  NaN    -7
row3   7.0    D    -8
row4  15.0    Z     3
row2   NaN    D    31

In [33]:
df.sort_values(by=['col2', 'col3'])

      col1 col2  col3
row1  -3.0    A    17
row3   7.0    D    -8
row2   NaN    D    31
row4  15.0    Z     3
row5   0.0  NaN    -7

In [34]:
df.sort_values(by='col3', axis=0)

      col1 col2  col3
row3   7.0    D    -8
row5   0.0  NaN    -7
row4  15.0    Z     3
row1  -3.0    A    17
row2   NaN    D    31

In [35]:
df.sort_valus(by='col3', axis=1 )   # axis=1 은 컬럼기준 정렬 (문자, 숫자 혼용되어 정렬이 안됨)

AttributeError: 'DataFrame' object has no attribute 'sort_valus'

In [ ]:
df.sort_values(by='row5',axis=1)

In [ ]:
df.sort_values(by='col3',ascending=False)  # 내림차순 정렬

In [ ]:
df.sort_values(by='col1', na_position='last')  # NaN 을 마지막에 배치

In [ ]:
df.sort_values(by='col1',na_position='first')  # NaN 을 처음에 배치

In [ ]:
df.sort_values(by='col1', ignore_index=True)  # 정렬 후 인덱스 초기화

In [ ]:
df.sort_values(by='col2', key=lambda x: x.str.lower())  # 대소문자 구분없이 정렬

In [36]:
df.sort_values(by='col1', inplace=True)  # 원본 데이터프레임 자체를 정렬
df

      col1 col2  col3
row1  -3.0    A    17
row5   0.0  NaN    -7
row3   7.0    D    -8
row4  15.0    Z     3
row2   NaN    D    31

## 인덱스 기준 정렬 (sort_index)

In [40]:
na = np.nan
index_tuples = [('row1', 'val1'), ('row1', 'val2'), ('row3', 'val3'), ('row3', 'val1'), ('row3', 'val2'), ('row2', 'val5'),('row2', 'val2')]
values = [ [1,2,3], [4,na,6], [7,8,9], [na,11,12], [13,14,15], [16,17,18], [19,20,21]]
index = pd.MultiIndex.from_tuples(index_tuples) # 인덱스 설정
df = pd.DataFrame(values, columns=['col4', 'col1', 'col2'], index = index)
df

           col4  col1  col2
row1 val1   1.0   2.0     3
     val2   4.0   NaN     6
row3 val3   7.0   8.0     9
     val1   NaN  11.0    12
     val2  13.0  14.0    15
row2 val5  16.0  17.0    18
     val2  19.0  20.0    21